In [2]:
import numpy as np
import pandas as pd

# Object creation

See the Data Structure Intro section.

Creating a Series by passing a list of values, letting pandas create a default integer index:

In [9]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
print(s)

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

# Creating a DataFrame by passing a NumPy array, with a datetime index and labeled columns:

In [12]:
dates = pd.date_range('20130101', periods=6)
print(dates)
print('****************************************')
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
print(df)
print('*********here gives error while in spyder not?!?*******************************')
#df2 = pd.DataFrame({'A': 1.,
#   ...:                     'B': pd.Timestamp('20130102'),
 #  ...:                     'C': pd.Series(1, index=list(range(4)), dtype='float32'),
 #  ...:                     'D': np.array([3] * 4, dtype='int32'),
 #  ...:                     'E': pd.Categorical(["test", "train", "test", "train"]),
 #  ...:                     'F': 'foo'})
 #  ...: 
print(df)

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')
****************************************
                   A         B         C         D
2013-01-01  0.243758  0.804382  1.224305  1.048426
2013-01-02 -0.049756 -1.838885  0.067626 -0.261874
2013-01-03  0.640082 -0.166754 -1.096106  0.919108
2013-01-04 -1.302892  0.735564  0.645516  0.789191
2013-01-05 -0.075498  0.197986  0.375950  0.326584
2013-01-06  1.407964 -2.006989 -1.015780 -0.034458
*********here gives error while in spyder not?!?*******************************
                   A         B         C         D
2013-01-01  0.243758  0.804382  1.224305  1.048426
2013-01-02 -0.049756 -1.838885  0.067626 -0.261874
2013-01-03  0.640082 -0.166754 -1.096106  0.919108
2013-01-04 -1.302892  0.735564  0.645516  0.789191
2013-01-05 -0.075498  0.197986  0.375950  0.326584
2013-01-06  1.407964 -2.006989 -1.015780 -0.034458

# VIEWING DATA
Here is how to view the top and bottom rows of the frame:

In [8]:
df.head()

NameError: name 'df' is not defined

In [17]:
df.tail()

                   A         B         C         D
2013-01-02 -1.200281 -1.407948 -1.104434  0.650948
2013-01-03  1.403980 -0.208480  1.386529 -0.024688
2013-01-04 -1.055277 -0.284359 -0.155887  0.353018
2013-01-05  0.073300 -0.236324  0.553948  0.985940
2013-01-06 -0.719413  1.718306 -1.400244  0.068856

In [18]:
df.tail(3)       #if you put number cut the list from bottom

                   A         B         C         D
2013-01-04 -1.055277 -0.284359 -0.155887  0.353018
2013-01-05  0.073300 -0.236324  0.553948  0.985940
2013-01-06 -0.719413  1.718306 -1.400244  0.068856

# Display the index, columns:
df.index() and df.column() gives error

# DataFrame.to_numpy() 
gives a NumPy representation of the underlying data. Note that this can be an expensive operation when your DataFrame has columns with different data types, which comes down to a fundamental difference between pandas and NumPy: NumPy arrays have one dtype for the entire array, while pandas DataFrames have one dtype per column. When you call DataFrame.to_numpy(), pandas will find the NumPy dtype that can hold all of the dtypes in the DataFrame. This may end up being object, which requires casting every value to a Python object.

In [21]:
df.to_numpy()

array([[ 1.75679227, -0.21631211,  0.00281559,  2.02982262],
       [-1.20028112, -1.40794793, -1.10443396,  0.6509477 ],
       [ 1.40398038, -0.20848011,  1.38652913, -0.02468787],
       [-1.05527723, -0.28435876, -0.1558865 ,  0.35301827],
       [ 0.07330022, -0.23632438,  0.55394835,  0.98593985],
       [-0.7194135 ,  1.71830575, -1.40024409,  0.06885588]])

In [ ]:
df.describe()      #Describe shortly about statistics summry

In [22]:
df.T               #Transpose your data

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    1.756792   -1.200281    1.403980   -1.055277    0.073300   -0.719413
B   -0.216312   -1.407948   -0.208480   -0.284359   -0.236324    1.718306
C    0.002816   -1.104434    1.386529   -0.155887    0.553948   -1.400244
D    2.029823    0.650948   -0.024688    0.353018    0.985940    0.068856

In [23]:
df.sort_index(axis=1, ascending=False)    #sorting data by axis

                   D         C         B         A
2013-01-01  2.029823  0.002816 -0.216312  1.756792
2013-01-02  0.650948 -1.104434 -1.407948 -1.200281
2013-01-03 -0.024688  1.386529 -0.208480  1.403980
2013-01-04  0.353018 -0.155887 -0.284359 -1.055277
2013-01-05  0.985940  0.553948 -0.236324  0.073300
2013-01-06  0.068856 -1.400244  1.718306 -0.719413

In [24]:
  df.sort_values(by='B')          #sorting by values which here just B  is sorted

                   A         B         C         D
2013-01-02 -1.200281 -1.407948 -1.104434  0.650948
2013-01-04 -1.055277 -0.284359 -0.155887  0.353018
2013-01-05  0.073300 -0.236324  0.553948  0.985940
2013-01-01  1.756792 -0.216312  0.002816  2.029823
2013-01-03  1.403980 -0.208480  1.386529 -0.024688
2013-01-06 -0.719413  1.718306 -1.400244  0.068856

# Getting
Selecting a single column, which yields a Series, equivalent to df.A:
See the indexing documentation Indexing and Selecting Data and MultiIndex / Advanced Indexing(links).

In [25]:
df['A']

2013-01-01    1.756792
2013-01-02   -1.200281
2013-01-03    1.403980
2013-01-04   -1.055277
2013-01-05    0.073300
2013-01-06   -0.719413
Freq: D, Name: A, dtype: float64

In [29]:
df[0:3]            #Selecting via [], which slices the rows.

                   A         B         C         D
2013-01-01  1.756792 -0.216312  0.002816  2.029823
2013-01-02 -1.200281 -1.407948 -1.104434  0.650948
2013-01-03  1.403980 -0.208480  1.386529 -0.024688

In [28]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -1.200281 -1.407948 -1.104434  0.650948
2013-01-03  1.403980 -0.208480  1.386529 -0.024688
2013-01-04 -1.055277 -0.284359 -0.155887  0.353018

# Selection by label
See more in Selection by Label(link).

For getting a cross section using a label:

In [33]:
df.loc[dates[0]]      #For getting a cross section using a label:

A    1.756792
B   -0.216312
C    0.002816
D    2.029823
Name: 2013-01-01 00:00:00, dtype: float64

In [31]:
df.loc[:, ['A', 'B']]    #Selecting on a multi-axis by label:

                   A         B
2013-01-01  1.756792 -0.216312
2013-01-02 -1.200281 -1.407948
2013-01-03  1.403980 -0.208480
2013-01-04 -1.055277 -0.284359
2013-01-05  0.073300 -0.236324
2013-01-06 -0.719413  1.718306

In [35]:
df.loc['20130102':'20130104', ['A', 'B','C']]    #Showing label slicing, both endpoints are included:

                   A         B         C
2013-01-02 -1.200281 -1.407948 -1.104434
2013-01-03  1.403980 -0.208480  1.386529
2013-01-04 -1.055277 -0.284359 -0.155887

# Selection by position
See more in Selection by Position.

In [13]:
df.iloc[3]     #Select via the position of the passed integers:

A   -1.302892
B    0.735564
C    0.645516
D    0.789191
Name: 2013-01-04 00:00:00, dtype: float64

In [14]:
df.iloc[3:5, 0:2]  #By integer slices, acting similar to numpy/python:

                   A         B
2013-01-04 -1.302892  0.735564
2013-01-05 -0.075498  0.197986

In [15]:
df.iloc[[1, 2, 4], [0, 2]]      #By lists of integer position locations, similar to the numpy/python style:

                   A         C
2013-01-02 -0.049756  0.067626
2013-01-03  0.640082 -1.096106
2013-01-05 -0.075498  0.375950

In [16]:
df.iloc[1:3, :]     #For slicing rows explicitly:

                   A         B         C         D
2013-01-02 -0.049756 -1.838885  0.067626 -0.261874
2013-01-03  0.640082 -0.166754 -1.096106  0.919108

In [17]:
df.iloc[:, 1:3]    #For slicing columns explicitly:

                   B         C
2013-01-01  0.804382  1.224305
2013-01-02 -1.838885  0.067626
2013-01-03 -0.166754 -1.096106
2013-01-04  0.735564  0.645516
2013-01-05  0.197986  0.375950
2013-01-06 -2.006989 -1.015780

In [18]:
df.iloc[1, 1]     #For getting a value explicitly:

-1.8388853772162577

In [ ]:
df.iat[1, 1]   #For getting fast access to a scalar (equivalent to the prior method):

# Boolen

In [19]:
df[df['A'] > 0]  #Using a single columnâ€™s values to select data.

                   A         B         C         D
2013-01-01  0.243758  0.804382  1.224305  1.048426
2013-01-03  0.640082 -0.166754 -1.096106  0.919108
2013-01-06  1.407964 -2.006989 -1.015780 -0.034458

In [23]:
df[df == 1]   #Selecting values from a DataFrame where a boolean condition is met.

             A   B   C   D
2013-01-01 NaN NaN NaN NaN
2013-01-02 NaN NaN NaN NaN
2013-01-03 NaN NaN NaN NaN
2013-01-04 NaN NaN NaN NaN
2013-01-05 NaN NaN NaN NaN
2013-01-06 NaN NaN NaN NaN

In [24]:
df[df>0]    #another example

                   A         B         C         D
2013-01-01  0.243758  0.804382  1.224305  1.048426
2013-01-02       NaN       NaN  0.067626       NaN
2013-01-03  0.640082       NaN       NaN  0.919108
2013-01-04       NaN  0.735564  0.645516  0.789191
2013-01-05       NaN  0.197986  0.375950  0.326584
2013-01-06  1.407964       NaN       NaN       NaN

Using the isin() method for filtering:
**HINT:it is useful when you want to filtering with within elements

In [25]:
df2 = df.copy()        #copy df to df2
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']    #adding E to df chart
df2

                   A         B         C         D      E
2013-01-01  0.243758  0.804382  1.224305  1.048426    one
2013-01-02 -0.049756 -1.838885  0.067626 -0.261874    one
2013-01-03  0.640082 -0.166754 -1.096106  0.919108    two
2013-01-04 -1.302892  0.735564  0.645516  0.789191  three
2013-01-05 -0.075498  0.197986  0.375950  0.326584   four
2013-01-06  1.407964 -2.006989 -1.015780 -0.034458  three

In [26]:
df2[df2['E'].isin(['two', 'four'])] #first part mention which part you want to use

                   A         B         C         D     E
2013-01-03  0.640082 -0.166754 -1.096106  0.919108   two
2013-01-05 -0.075498  0.197986  0.375950  0.326584  four

# Setting
Setting a new column automatically aligns the data by the indexes.

In [27]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [28]:
df['F'] = s1   #Adding column f to our data

In [29]:
df.at[dates[0], 'A'] = 0   #Setting values by label:

In [30]:
df.iat[0, 1] = 0      #Setting values by position:

In [31]:
df.loc[:, 'D'] = np.array([5] * len(df))  #Setting by assigning with a NumPy array:
df      #At the end...

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  1.224305  5  NaN
2013-01-02 -0.049756 -1.838885  0.067626  5  1.0
2013-01-03  0.640082 -0.166754 -1.096106  5  2.0
2013-01-04 -1.302892  0.735564  0.645516  5  3.0
2013-01-05 -0.075498  0.197986  0.375950  5  4.0
2013-01-06  1.407964 -2.006989 -1.015780  5  5.0

In [32]:
df2 = df.copy()       #copy df to df2

In [33]:
df2[df2 > 0] = -df2   #we define situation which if elements is greater than 0 change it negative
df2      #At the end..

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.224305 -5  NaN
2013-01-02 -0.049756 -1.838885 -0.067626 -5 -1.0
2013-01-03 -0.640082 -0.166754 -1.096106 -5 -2.0
2013-01-04 -1.302892 -0.735564 -0.645516 -5 -3.0
2013-01-05 -0.075498 -0.197986 -0.375950 -5 -4.0
2013-01-06 -1.407964 -2.006989 -1.015780 -5 -5.0

# MISSING DATA
pandas primarily uses the value np.nan to represent missing data. It is by default not included in computations. See the Missing Data section.

In [35]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E']) ##adding E coulumn for which has missing data
df1.loc[dates[0]:dates[1], 'E'] = 1
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  1.224305  5  NaN  1.0
2013-01-02 -0.049756 -1.838885  0.067626  5  1.0  1.0
2013-01-03  0.640082 -0.166754 -1.096106  5  2.0  NaN
2013-01-04 -1.302892  0.735564  0.645516  5  3.0  NaN

In [36]:
df1.dropna(how='any')    #To drop any rows that have missing data.

                   A         B         C  D    F    E
2013-01-02 -0.049756 -1.838885  0.067626  5  1.0  1.0

Filling missing data

In [37]:
df1.fillna(value=5)   #fill nan(which is missing DATA) with 5

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  1.224305  5  5.0  1.0
2013-01-02 -0.049756 -1.838885  0.067626  5  1.0  1.0
2013-01-03  0.640082 -0.166754 -1.096106  5  2.0  5.0
2013-01-04 -1.302892  0.735564  0.645516  5  3.0  5.0

In [38]:
pd.isna(df1)   ##To get the boolean mask where values are nan.

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

# Operations

Stats

Operations in general exclude missing data.
Performing a descriptive statistic:

In [39]:
df.mean()   #take mean from each row

A    0.103317
B   -0.513180
C    0.033585
D    5.000000
F    3.000000
dtype: float64

In [40]:
df.mean(1)  #take mean from 2nd row

2013-01-01    1.556076
2013-01-02    0.835797
2013-01-03    1.275444
2013-01-04    1.615637
2013-01-05    1.899688
2013-01-06    1.677039
Freq: D, dtype: float64

Operating with objects that have different dimensionality and need alignment. In addition, pandas automatically broadcasts along the specified dimension.

In [41]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [42]:
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -0.359918 -1.166754 -2.096106  4.0  1.0
2013-01-04 -4.302892 -2.264436 -2.354484  2.0  0.0
2013-01-05 -5.075498 -4.802014 -4.624050  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN